jyyy3901/GD32_HAL_Compat/Include/stm32_hal_port_api.h
#ifndef STM32_HAL_PORT_API_H
#define STM32_HAL_PORT_API_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_hal_conf.h"
#include <stdint.h>

/*
 * 本文件只描述 HAL compatible API 与目标 Port 的窄接口。
 * 它不包含 GD32 CMSIS/SPL 头文件，也不公开寄存器地址。
 */

#define GD32_HAL_DMA_REQUEST_MEMORY 0U
#define GD32_HAL_DMA_REQUEST_ENCODE(CONTROLLER, CHANNEL, SLOT) \
    (0x80000000UL | ((uint32_t)(CONTROLLER) << 16U) | \
     ((uint32_t)(CHANNEL) << 8U) | ((uint32_t)(SLOT) + 1U))


typedef enum
{
    GD32_HAL_RESOURCE_GPIO = 0,
    GD32_HAL_RESOURCE_UART,
    GD32_HAL_RESOURCE_DMA,
    GD32_HAL_RESOURCE_TIMER,
    GD32_HAL_RESOURCE_ADC,
    GD32_HAL_RESOURCE_I2C,
    GD32_HAL_RESOURCE_SPI
} GD32_HAL_ResourceKind;

typedef struct GD32_HAL_Resource
{
    uintptr_t semantic_id;
    uintptr_t stm32_instance;
    uint32_t gd32_instance;
    uint32_t gd32_periph;
    uint32_t gd32_clock;
    int32_t gd32_irq;
    uint32_t capabilities;
    uint8_t logical_index;
    uint8_t gd32_channel;
} GD32_HAL_Resource;

#define GD32_HAL_CAP_FLOW_CONTROL (1UL << 0U)
#define GD32_HAL_CAP_DMA          (1UL << 1U)
#define GD32_HAL_CAP_MASTER_SLAVE (1UL << 2U)
#define GD32_HAL_CAP_TRGO         (1UL << 3U)
#define GD32_HAL_CAP_ADVANCED     (1UL << 4U)
#define GD32_HAL_CAP_CHANNEL_1    (1UL << 8U)
#define GD32_HAL_CAP_CHANNEL_2    (1UL << 9U)
#define GD32_HAL_CAP_CHANNEL_3    (1UL << 10U)
#define GD32_HAL_CAP_CHANNEL_4    (1UL << 11U)

typedef enum
{
    GD32_HAL_GPIO_MODE_ANALOG = 0,
    GD32_HAL_GPIO_MODE_INPUT_FLOATING,
    GD32_HAL_GPIO_MODE_INPUT_PULLUP,
    GD32_HAL_GPIO_MODE_INPUT_PULLDOWN,
    GD32_HAL_GPIO_MODE_OUTPUT_PP,
    GD32_HAL_GPIO_MODE_OUTPUT_OD,
    GD32_HAL_GPIO_MODE_AF_PP,
    GD32_HAL_GPIO_MODE_AF_OD
} GD32_HAL_GPIOMode;

typedef enum
{
    GD32_HAL_GPIO_SPEED_2MHZ = 0,
    GD32_HAL_GPIO_SPEED_10MHZ,
    GD32_HAL_GPIO_SPEED_50MHZ,
    GD32_HAL_GPIO_SPEED_MAX
} GD32_HAL_GPIOSpeed;

typedef enum
{
    GD32_HAL_EXTI_INTERRUPT = 0,
    GD32_HAL_EXTI_EVENT
} GD32_HAL_EXTIMode;

typedef enum
{
    GD32_HAL_EXTI_RISING = 0,
    GD32_HAL_EXTI_FALLING,
    GD32_HAL_EXTI_BOTH
} GD32_HAL_EXTITrigger;

typedef enum
{
    GD32_HAL_RCC_CLOCK_SYS = 0,
    GD32_HAL_RCC_CLOCK_AHB,
    GD32_HAL_RCC_CLOCK_APB1,
    GD32_HAL_RCC_CLOCK_APB2
} GD32_HAL_RCCClock;

typedef enum
{
    GD32_HAL_RCC_COMMON_AF = 0,
    GD32_HAL_RCC_COMMON_PMU,
    GD32_HAL_RCC_COMMON_CRC
} GD32_HAL_RCCCommonClock;

typedef enum
{
    GD32_HAL_RCC_SOURCE_IRC8M = 0,
    GD32_HAL_RCC_SOURCE_HXTAL,
    GD32_HAL_RCC_SOURCE_PLL
} GD32_HAL_RCCSource;

#define GD32_HAL_RCC_HXTAL_OFF 0U
#define GD32_HAL_RCC_HXTAL_ON 1U
#define GD32_HAL_RCC_HXTAL_BYPASS 2U
#define GD32_HAL_RCC_OSC_IRC8M_ON (1UL << 0U)
#define GD32_HAL_RCC_OSC_HXTAL_ON (1UL << 1U)
#define GD32_HAL_RCC_OSC_HXTAL_BYPASS (1UL << 2U)
#define GD32_HAL_RCC_OSC_PLL_ON (1UL << 3U)

typedef enum
{
    GD32_HAL_FLASH_READY = 0,
    GD32_HAL_FLASH_BUSY,
    GD32_HAL_FLASH_PROGRAM_ERROR,
    GD32_HAL_FLASH_WRITE_PROTECT_ERROR,
    GD32_HAL_FLASH_TIMEOUT
} GD32_HAL_FLASHStatus;

typedef enum
{
    GD32_HAL_FLASH_IT_NONE = 0U,
    GD32_HAL_FLASH_IT_END = (1UL << 0U),
    GD32_HAL_FLASH_IT_PROGRAM_ERROR = (1UL << 1U),
    GD32_HAL_FLASH_IT_WRITE_PROTECT_ERROR = (1UL << 2U)
} GD32_HAL_FLASHInterrupt;

typedef enum
{
    GD32_HAL_PORT_ERROR_NONE = 0,
    GD32_HAL_PORT_ERROR_INVALID_INSTANCE,
    GD32_HAL_PORT_ERROR_INVALID_PIN,
    GD32_HAL_PORT_ERROR_OUTPUT_PULL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_AF_SELECTION_REQUIRES_NATIVE_INIT,
    GD32_HAL_PORT_ERROR_TICK_RELOAD,
    GD32_HAL_PORT_ERROR_UART_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_UART_OVERSAMPLING_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_FLOW_CONTROL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_BAUD_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_DMA_PHASE_REQUIRED,
    GD32_HAL_PORT_ERROR_UART_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_UART_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_DMA_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_CONFIG,
    GD32_HAL_PORT_ERROR_DMA_REQUEST_MISMATCH,
    GD32_HAL_PORT_ERROR_DMA_CHANNEL_CONFLICT,
    GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_FLAG,
    GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE,
    GD32_HAL_PORT_ERROR_TIMER_COUNTER_MODE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_REPETITION_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_MASTER_SLAVE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_ITR_UNMAPPABLE,
    GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_TIMER_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_ADC_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_ADC_CLOCK_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_TRIGGER_EDGE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_TRIGGER_UNMAPPABLE,
    GD32_HAL_PORT_ERROR_ADC_SAMPLE_TIME_UNMAPPABLE,
    GD32_HAL_PORT_ERROR_ADC_CHANNEL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_EOC_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_ADC_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_ADC_OVERRUN_UNAVAILABLE,
    GD32_HAL_PORT_ERROR_ADC_CALIBRATION_TIMEOUT,
    GD32_HAL_PORT_ERROR_I2C_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_I2C_TIMEOUT,
    GD32_HAL_PORT_ERROR_I2C_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_SPI_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_SPI_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_SPI_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_SPI_TIMEOUT,
    GD32_HAL_PORT_ERROR_RCC_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_RCC_PLL_MODEL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_RCC_CLOCK_LIMIT,
    GD32_HAL_PORT_ERROR_EXTI_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_FLASH_INVALID_RANGE,
    GD32_HAL_PORT_ERROR_FLASH_WRITABLE_REGION_REQUIRED,
    GD32_HAL_PORT_ERROR_FLASH_PROGRAM_TYPE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_FLASH_MASS_ERASE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_FLASH_OPERATION
} GD32_HAL_PortError;

typedef enum
{
    GD32_HAL_I2C_FLAG_START = (1UL << 0U),
    GD32_HAL_I2C_FLAG_ADDRESS = (1UL << 1U),
    GD32_HAL_I2C_FLAG_BYTE_TRANSFER = (1UL << 2U),
    GD32_HAL_I2C_FLAG_ADDRESS10 = (1UL << 3U),
    GD32_HAL_I2C_FLAG_RX_NOT_EMPTY = (1UL << 4U),
    GD32_HAL_I2C_FLAG_TX_EMPTY = (1UL << 5U),
    GD32_HAL_I2C_FLAG_BUSY = (1UL << 6U)
} GD32_HAL_I2CFlag;

#define GD32_HAL_I2C_ERROR_BUS         (1UL << 0U)
#define GD32_HAL_I2C_ERROR_ARBITRATION (1UL << 1U)
#define GD32_HAL_I2C_ERROR_ACK         (1UL << 2U)
#define GD32_HAL_I2C_ERROR_OVERRUN     (1UL << 3U)
#define GD32_HAL_I2C_ERROR_PEC         (1UL << 4U)
#define GD32_HAL_I2C_ERROR_TIMEOUT     (1UL << 5U)

