jyyy3901/GD32_HAL_Compat/Include/stm32_hal_port_api.h
#define GD32_HAL_I2C_INTERRUPT_ERROR (1UL << 0U)
#define GD32_HAL_I2C_INTERRUPT_EVENT (1UL << 1U)
#define GD32_HAL_I2C_INTERRUPT_BUFFER (1UL << 2U)

typedef struct
{
    uint32_t clock_speed;
    uint16_t own_address1;
    uint16_t own_address2;
    uint8_t duty_16_9;
    uint8_t address_10bit;
    uint8_t dual_address;
    uint8_t general_call;
    uint8_t no_stretch;
} GD32_HAL_I2CConfig;

typedef enum
{
    GD32_HAL_SPI_FLAG_RX_NOT_EMPTY = (1UL << 0U),
    GD32_HAL_SPI_FLAG_TX_EMPTY = (1UL << 1U),
    GD32_HAL_SPI_FLAG_BUSY = (1UL << 2U)
} GD32_HAL_SPIFlag;

#define GD32_HAL_SPI_ERROR_MODE    (1UL << 0U)
#define GD32_HAL_SPI_ERROR_CRC     (1UL << 1U)
#define GD32_HAL_SPI_ERROR_OVERRUN (1UL << 2U)
#define GD32_HAL_SPI_ERROR_FRAME   (1UL << 3U)

#define GD32_HAL_SPI_INTERRUPT_TX    (1UL << 0U)
#define GD32_HAL_SPI_INTERRUPT_RX    (1UL << 1U)
#define GD32_HAL_SPI_INTERRUPT_ERROR (1UL << 2U)

typedef struct
{
    uint8_t master;
    uint8_t direction;
    uint8_t data_bits;
    uint8_t clock_polarity_high;
    uint8_t clock_phase_second;
    uint8_t nss;
    uint16_t prescaler;
    uint8_t lsb_first;
    uint8_t ti_mode;
    uint8_t crc_enable;
    uint16_t crc_polynomial;
} GD32_HAL_SPIConfig;

typedef enum
{
    GD32_HAL_ADC_TRIGGER_SOFTWARE = 0,
    GD32_HAL_ADC_TRIGGER_TIMER0_CH0,
    GD32_HAL_ADC_TRIGGER_TIMER0_CH1,
    GD32_HAL_ADC_TRIGGER_TIMER0_CH2,
    GD32_HAL_ADC_TRIGGER_TIMER1_CH1,
    GD32_HAL_ADC_TRIGGER_TIMER2_TRGO,
    GD32_HAL_ADC_TRIGGER_TIMER3_CH3,
    GD32_HAL_ADC_TRIGGER_TIMER7_TRGO,
    GD32_HAL_ADC_TRIGGER_EXTI11
} GD32_HAL_ADCTrigger;

typedef enum
{
    GD32_HAL_ADC_FLAG_EOC = (1UL << 0U),
    GD32_HAL_ADC_FLAG_OVERRUN_UNAVAILABLE = (1UL << 1U)
} GD32_HAL_ADCFlag;

typedef enum
{
    GD32_HAL_ADC_INTERRUPT_EOC = (1UL << 0U),
    GD32_HAL_ADC_INTERRUPT_OVERRUN_UNAVAILABLE = (1UL << 1U)
} GD32_HAL_ADCInterrupt;

typedef struct
{
    uint8_t clock_divider;
    uint8_t resolution_bits;
    uint8_t align_left;
    uint8_t scan;
    uint8_t continuous;
    uint8_t discontinuous;
    uint8_t discontinuous_count;
    uint8_t sequence_length;
    GD32_HAL_ADCTrigger trigger;
} GD32_HAL_ADCConfig;

typedef enum
{
    GD32_HAL_TIMER_ALIGNMENT_EDGE = 0,
    GD32_HAL_TIMER_ALIGNMENT_CENTER_DOWN,
    GD32_HAL_TIMER_ALIGNMENT_CENTER_UP,
    GD32_HAL_TIMER_ALIGNMENT_CENTER_BOTH
} GD32_HAL_TIMERAlignment;

typedef enum
{
    GD32_HAL_TIMER_DIRECTION_UP = 0,
    GD32_HAL_TIMER_DIRECTION_DOWN
} GD32_HAL_TIMERDirection;

typedef enum
{
    GD32_HAL_TIMER_OC_TIMING = 0,
    GD32_HAL_TIMER_OC_ACTIVE,
    GD32_HAL_TIMER_OC_INACTIVE,
    GD32_HAL_TIMER_OC_TOGGLE,
    GD32_HAL_TIMER_OC_FORCED_INACTIVE,
    GD32_HAL_TIMER_OC_FORCED_ACTIVE,
    GD32_HAL_TIMER_OC_PWM1,
    GD32_HAL_TIMER_OC_PWM2
} GD32_HAL_TIMEROCMode;

typedef enum
{
    GD32_HAL_TIMER_POLARITY_RISING_HIGH = 0,
    GD32_HAL_TIMER_POLARITY_FALLING_LOW,
    GD32_HAL_TIMER_POLARITY_BOTH
} GD32_HAL_TIMERPolarity;

typedef enum
{
    GD32_HAL_TIMER_IC_DIRECT = 0,
    GD32_HAL_TIMER_IC_INDIRECT,
    GD32_HAL_TIMER_IC_TRIGGER
} GD32_HAL_TIMERICSelection;

typedef enum
{
    GD32_HAL_TIMER_INTERRUPT_UPDATE = (1UL << 0U),
    GD32_HAL_TIMER_INTERRUPT_CC1 = (1UL << 1U),
    GD32_HAL_TIMER_INTERRUPT_CC2 = (1UL << 2U),
    GD32_HAL_TIMER_INTERRUPT_CC3 = (1UL << 3U),
    GD32_HAL_TIMER_INTERRUPT_CC4 = (1UL << 4U),
    GD32_HAL_TIMER_INTERRUPT_COM = (1UL << 5U),
    GD32_HAL_TIMER_INTERRUPT_TRIGGER = (1UL << 6U),
    GD32_HAL_TIMER_INTERRUPT_BREAK = (1UL << 7U)
} GD32_HAL_TIMERInterrupt;

typedef enum
{
    GD32_HAL_TIMER_FLAG_UPDATE = (1UL << 0U),
    GD32_HAL_TIMER_FLAG_CC1 = (1UL << 1U),
    GD32_HAL_TIMER_FLAG_CC2 = (1UL << 2U),
    GD32_HAL_TIMER_FLAG_CC3 = (1UL << 3U),
    GD32_HAL_TIMER_FLAG_CC4 = (1UL << 4U),
    GD32_HAL_TIMER_FLAG_COM = (1UL << 5U),
    GD32_HAL_TIMER_FLAG_TRIGGER = (1UL << 6U),
    GD32_HAL_TIMER_FLAG_BREAK = (1UL << 7U),
    GD32_HAL_TIMER_FLAG_CC1_OVER = (1UL << 9U),
    GD32_HAL_TIMER_FLAG_CC2_OVER = (1UL << 10U),
    GD32_HAL_TIMER_FLAG_CC3_OVER = (1UL << 11U),
    GD32_HAL_TIMER_FLAG_CC4_OVER = (1UL << 12U)
} GD32_HAL_TIMERFlag;

typedef enum
{
    GD32_HAL_TIMER_DMA_UPDATE = 0,
    GD32_HAL_TIMER_DMA_CC1,
    GD32_HAL_TIMER_DMA_CC2,
    GD32_HAL_TIMER_DMA_CC3,
    GD32_HAL_TIMER_DMA_CC4,
    GD32_HAL_TIMER_DMA_COM,
    GD32_HAL_TIMER_DMA_TRIGGER
} GD32_HAL_TIMERDMARequest;

typedef struct
{
    uint16_t prescaler;
    uint16_t period;
    GD32_HAL_TIMERAlignment alignment;
    GD32_HAL_TIMERDirection direction;
    uint8_t clock_division;
    uint8_t repetition;
    uint8_t auto_reload_preload;
} GD32_HAL_TIMERBaseConfig;

typedef struct
{
    GD32_HAL_TIMEROCMode mode;
    uint16_t pulse;
    GD32_HAL_TIMERPolarity polarity;
    uint8_t fast;
    uint8_t idle_high;
    uint8_t preload;
} GD32_HAL_TIMEROCConfig;

typedef struct
{
    GD32_HAL_TIMERPolarity polarity;
    GD32_HAL_TIMERICSelection selection;
    uint8_t prescaler;
    uint8_t filter;
} GD32_HAL_TIMERICConfig;

typedef struct
{
    uintptr_t stm32_timer_instance;
    uint8_t slave_mode;
    uint8_t input_trigger;
    GD32_HAL_TIMERPolarity trigger_polarity;
    uint8_t trigger_prescaler;
    uint8_t trigger_filter;
} GD32_HAL_TIMERSlaveConfig;

typedef enum
{
    GD32_HAL_UART_PARITY_NONE = 0,
    GD32_HAL_UART_PARITY_EVEN,
    GD32_HAL_UART_PARITY_ODD
} GD32_HAL_UARTParity;

typedef enum
{
    GD32_HAL_UART_INTERRUPT_PE = 0,
    GD32_HAL_UART_INTERRUPT_TX_EMPTY,
    GD32_HAL_UART_INTERRUPT_TX_COMPLETE,
    GD32_HAL_UART_INTERRUPT_RX_NOT_EMPTY,
    GD32_HAL_UART_INTERRUPT_IDLE,
    GD32_HAL_UART_INTERRUPT_LIN_BREAK,
    GD32_HAL_UART_INTERRUPT_CTS,
    GD32_HAL_UART_INTERRUPT_ERROR
} GD32_HAL_UARTInterrupt;

typedef enum
{
    GD32_HAL_UART_FLAG_PE = (1UL << 0U),
    GD32_HAL_UART_FLAG_FE = (1UL << 1U),
    GD32_HAL_UART_FLAG_NE = (1UL << 2U),
    GD32_HAL_UART_FLAG_ORE = (1UL << 3U),
    GD32_HAL_UART_FLAG_IDLE = (1UL << 4U),
    GD32_HAL_UART_FLAG_RX_NOT_EMPTY = (1UL << 5U),
    GD32_HAL_UART_FLAG_TX_COMPLETE = (1UL << 6U),
    GD32_HAL_UART_FLAG_TX_EMPTY = (1UL << 7U),
    GD32_HAL_UART_FLAG_LIN_BREAK = (1UL << 8U),
    GD32_HAL_UART_FLAG_CTS = (1UL << 9U)
} GD32_HAL_UARTFlag;

#define GD32_HAL_UART_ERROR_PE   (1UL << 0U)
#define GD32_HAL_UART_ERROR_FE   (1UL << 1U)
#define GD32_HAL_UART_ERROR_NE   (1UL << 2U)
#define GD32_HAL_UART_ERROR_ORE  (1UL << 3U)

#define GD32_HAL_UART_MODE_TX    (1UL << 0U)
#define GD32_HAL_UART_MODE_RX    (1UL << 1U)
#define GD32_HAL_UART_FLOW_RTS   (1UL << 0U)
#define GD32_HAL_UART_FLOW_CTS   (1UL << 1U)

typedef struct
{
    uint32_t baud_rate;
    uint8_t word_length;
    uint8_t stop_bits;
    GD32_HAL_UARTParity parity;
    uint8_t mode;
    uint8_t flow_control;
} GD32_HAL_UARTConfig;

