jyyy3901/GD32_HAL_Compat/Include/stm32_hal_port_api.h
typedef enum
{
    GD32_HAL_DMA_DIRECTION_PERIPH_TO_MEMORY = 0,
    GD32_HAL_DMA_DIRECTION_MEMORY_TO_PERIPH,
    GD32_HAL_DMA_DIRECTION_MEMORY_TO_MEMORY
} GD32_HAL_DMADirection;

typedef enum
{
    GD32_HAL_DMA_FLAG_FULL = (1UL << 0U),
    GD32_HAL_DMA_FLAG_HALF = (1UL << 1U),
    GD32_HAL_DMA_FLAG_ERROR = (1UL << 2U),
    GD32_HAL_DMA_FLAG_FIFO_UNSUPPORTED = (1UL << 3U),
    GD32_HAL_DMA_FLAG_DIRECT_UNSUPPORTED = (1UL << 4U)
} GD32_HAL_DMAFlag;

typedef enum
{
    GD32_HAL_DMA_INTERRUPT_FULL = (1UL << 0U),
    GD32_HAL_DMA_INTERRUPT_HALF = (1UL << 1U),
    GD32_HAL_DMA_INTERRUPT_ERROR = (1UL << 2U),
    GD32_HAL_DMA_INTERRUPT_FIFO_UNSUPPORTED = (1UL << 3U),
    GD32_HAL_DMA_INTERRUPT_DIRECT_UNSUPPORTED = (1UL << 4U)
} GD32_HAL_DMAInterrupt;

typedef struct
{
    GD32_HAL_DMADirection direction;
    uint8_t periph_increment;
    uint8_t memory_increment;
    uint8_t periph_width;
    uint8_t memory_width;
    uint8_t circular;
    uint8_t priority;
} GD32_HAL_DMAConfig;

/* 默认钩子记录最近错误；产品工程可覆盖并接入断言、日志或安全状态。 */
extern __IO GD32_HAL_PortError gd32HalLastPortError;
extern __IO uint32_t gd32HalLastPortErrorDetail;
void GD32_HAL_ErrorHook(GD32_HAL_PortError error, uint32_t detail);

int GD32_HAL_PortInit(void);
int GD32_HAL_PortDeInit(void);
uint32_t GD32_HAL_ReadUIDWord(uint8_t index);
const GD32_HAL_Resource *GD32_HAL_ResolveInstance(uintptr_t stm32_instance,
                                                  GD32_HAL_ResourceKind kind);
const GD32_HAL_Resource *GD32_HAL_ResolveDMAStream(uintptr_t stream_instance,
                                                   uint32_t stm32_channel,
                                                   uint32_t stm32_direction,
                                                   uint32_t *gd32_request);

int GD32_HAL_GPIO_IsInstance(uint32_t gpio_address);
int GD32_HAL_GPIO_ArePinsAvailable(uint32_t gpio_address, uint32_t pins);
int GD32_HAL_GPIO_GetPortSource(uint32_t gpio_address, uint8_t *port_source);
void GD32_HAL_GPIO_InitPins(uint32_t gpio_address,
                            GD32_HAL_GPIOMode mode,
                            GD32_HAL_GPIOSpeed speed,
                            uint32_t pins);
void GD32_HAL_GPIO_DeInitPins(uint32_t gpio_address, uint32_t pins);
uint32_t GD32_HAL_GPIO_ReadPins(uint32_t gpio_address, uint32_t pins);
void GD32_HAL_GPIO_WritePins(uint32_t gpio_address, uint32_t pins, int set);
void GD32_HAL_GPIO_TogglePins(uint32_t gpio_address, uint32_t pins);
int GD32_HAL_GPIO_LockPins(uint32_t gpio_address, uint32_t pins);
void GD32_HAL_GPIO_ConfigEXTI(uint32_t gpio_address,
                              uint32_t pins,
                              GD32_HAL_EXTIMode mode,
                              GD32_HAL_EXTITrigger trigger);
uint32_t GD32_HAL_GPIO_EXTIPending(uint32_t pins);
void GD32_HAL_GPIO_EXTIClear(uint32_t pins);
void GD32_HAL_GPIO_EXTIGenerate(uint32_t pins);

int GD32_HAL_UART_IsInstance(uint32_t uart_address);
int GD32_HAL_UART_IsFlowControlCapable(uint32_t uart_address);
int GD32_HAL_UART_IsDMACapable(uint32_t uart_address);
int GD32_HAL_UART_IsDMARequestActive(uint32_t uart_address, int transmit);
int GD32_HAL_UART_IsDMAChannelValid(uint32_t uart_address,
                                    int transmit,
                                    uint32_t channel_address,
                                    uint32_t request);
uint32_t GD32_HAL_UART_GetDataAddress(uint32_t uart_address);
int GD32_HAL_UART_Configure(uint32_t uart_address, const GD32_HAL_UARTConfig *config);
void GD32_HAL_UART_DeInit(uint32_t uart_address);
void GD32_HAL_UART_Enable(uint32_t uart_address);
void GD32_HAL_UART_Disable(uint32_t uart_address);
uint32_t GD32_HAL_UART_GetFlag(uint32_t uart_address, GD32_HAL_UARTFlag flag);
void GD32_HAL_UART_ClearFlag(uint32_t uart_address, GD32_HAL_UARTFlag flag);
uint32_t GD32_HAL_UART_GetErrorFlags(uint32_t uart_address);
void GD32_HAL_UART_ClearErrors(uint32_t uart_address);
void GD32_HAL_UART_WriteData(uint32_t uart_address, uint16_t data);
uint16_t GD32_HAL_UART_ReadData(uint32_t uart_address);
void GD32_HAL_UART_SetInterrupt(uint32_t uart_address,
                               GD32_HAL_UARTInterrupt interrupt,
                               int enable);
int GD32_HAL_UART_IsInterruptEnabled(uint32_t uart_address,
                                    GD32_HAL_UARTInterrupt interrupt);
void GD32_HAL_UART_EnableDMARequest(uint32_t uart_address, int transmit);
void GD32_HAL_UART_DisableDMARequest(uint32_t uart_address, int transmit);
int GD32_HAL_DMA_IsInstance(uint32_t channel_address);
int GD32_HAL_DMA_IsRequestValid(uint32_t channel_address,
                                uint32_t request,
                                GD32_HAL_DMADirection direction);
uint32_t GD32_HAL_DMA_GetControllerAddress(uint32_t channel_address);
uint32_t GD32_HAL_DMA_GetChannelIndex(uint32_t channel_address);
int GD32_HAL_DMA_Claim(uint32_t channel_address, const void *owner);
void GD32_HAL_DMA_Release(uint32_t channel_address, const void *owner);
void GD32_HAL_DMA_ResetOwnership(void);
int GD32_HAL_DMA_Configure(uint32_t channel_address,
                           const GD32_HAL_DMAConfig *config);
void GD32_HAL_DMA_DeInit(uint32_t channel_address);
void GD32_HAL_DMA_SetTransfer(uint32_t channel_address,
                              GD32_HAL_DMADirection direction,
                              uint32_t source,
                              uint32_t destination,
                              uint32_t count);
void GD32_HAL_DMA_Enable(uint32_t channel_address);
void GD32_HAL_DMA_Disable(uint32_t channel_address);
int GD32_HAL_DMA_IsEnabled(uint32_t channel_address);
uint32_t GD32_HAL_DMA_GetFlag(uint32_t channel_address, uint32_t flags);
void GD32_HAL_DMA_ClearFlag(uint32_t channel_address, uint32_t flags);
void GD32_HAL_DMA_SetInterrupt(uint32_t channel_address,
                               uint32_t interrupts,
                               int enable);
uint32_t GD32_HAL_DMA_GetInterrupts(uint32_t channel_address);
void GD32_HAL_DMA_SetRemaining(uint32_t channel_address, uint32_t count);
uint32_t GD32_HAL_DMA_GetRemaining(uint32_t channel_address);
int GD32_HAL_TIMER_IsInstance(uint32_t timer_address);
int GD32_HAL_TIMER_IsChannelValid(uint32_t timer_address, uint8_t channel);
int GD32_HAL_TIMER_IsOnePulseCapable(uint32_t timer_address);
int GD32_HAL_TIMER_IsMasterSlaveCapable(uint32_t timer_address);
int GD32_HAL_TIMER_ConfigureBase(uint32_t timer_address,
                                 const GD32_HAL_TIMERBaseConfig *config);
void GD32_HAL_TIMER_DeInit(uint32_t timer_address);
void GD32_HAL_TIMER_Enable(uint32_t timer_address);
void GD32_HAL_TIMER_Disable(uint32_t timer_address);
void GD32_HAL_TIMER_DisableIfIdle(uint32_t timer_address);
int GD32_HAL_TIMER_IsEnabled(uint32_t timer_address);
int GD32_HAL_TIMER_IsTriggerSlaveMode(uint32_t timer_address);
void GD32_HAL_TIMER_SetInternalClock(uint32_t timer_address);
int GD32_HAL_TIMER_ConfigureOutput(uint32_t timer_address,
                                   uint8_t channel,
                                   const GD32_HAL_TIMEROCConfig *config);
int GD32_HAL_TIMER_ConfigureInput(uint32_t timer_address,
                                  uint8_t channel,
                                  const GD32_HAL_TIMERICConfig *config);
void GD32_HAL_TIMER_SetChannel(uint32_t timer_address,
                               uint8_t channel,
                               int enable);
int GD32_HAL_TIMER_IsChannelInput(uint32_t timer_address, uint8_t channel);
void GD32_HAL_TIMER_SetOnePulse(uint32_t timer_address, int single);
int GD32_HAL_TIMER_ConfigureMaster(uint32_t timer_address,
                                   uint8_t trigger_output,
                                   int master_slave_enable);
int GD32_HAL_TIMER_ConfigureSlave(uint32_t timer_address,
                                  const GD32_HAL_TIMERSlaveConfig *config);
int STM32_TIMER_TriggerToGD32ITI(uintptr_t stm32_timer_instance,
                                 uint8_t stm_itr,
                                 uint8_t *gd_itr);
void GD32_HAL_TIMER_SetInterrupt(uint32_t timer_address,
                                 uint32_t interrupts,
                                 int enable);
uint32_t GD32_HAL_TIMER_GetInterrupts(uint32_t timer_address);
uint32_t GD32_HAL_TIMER_GetFlag(uint32_t timer_address, uint32_t flags);
void GD32_HAL_TIMER_ClearFlag(uint32_t timer_address, uint32_t flags);
void GD32_HAL_TIMER_SetDMARequest(uint32_t timer_address,
                                  GD32_HAL_TIMERDMARequest request,
                                  int enable);
int GD32_HAL_TIMER_IsDMAChannelValid(uint32_t timer_address,
                                     GD32_HAL_TIMERDMARequest request,
                                     uint32_t channel_address,
                                     uint32_t request_token);
uint32_t GD32_HAL_TIMER_GetDMADataAddress(uint32_t timer_address,
                                          GD32_HAL_TIMERDMARequest request);
void GD32_HAL_TIMER_SetCounter(uint32_t timer_address, uint32_t value);
uint32_t GD32_HAL_TIMER_GetCounter(uint32_t timer_address);
void GD32_HAL_TIMER_SetAutoReload(uint32_t timer_address, uint32_t value);
uint32_t GD32_HAL_TIMER_GetAutoReload(uint32_t timer_address);
void GD32_HAL_TIMER_SetPrescaler(uint32_t timer_address, uint32_t value);
uint32_t GD32_HAL_TIMER_GetPrescaler(uint32_t timer_address);
void GD32_HAL_TIMER_SetCompare(uint32_t timer_address,
                               uint8_t channel,
                               uint32_t value);
uint32_t GD32_HAL_TIMER_GetCompare(uint32_t timer_address, uint8_t channel);
int GD32_HAL_ADC_IsInstance(uint32_t adc_address);
int GD32_HAL_ADC_MapSTM32Trigger(uint32_t stm32_source,
                                 uint32_t stm32_edge,
                                 GD32_HAL_ADCTrigger *trigger);
int GD32_HAL_ADC_MapSTM32SampleTime(uint32_t stm32_sample_time,
                                    uint8_t *gd32_sample_index);
int GD32_HAL_ADC_Configure(uint32_t adc_address,
                           const GD32_HAL_ADCConfig *config);
void GD32_HAL_ADC_DeInit(uint32_t adc_address);
int GD32_HAL_ADC_ConfigChannel(uint32_t adc_address,
                               uint8_t rank,
                               uint8_t channel,
                               uint8_t sample_time);
int GD32_HAL_ADC_EnableAndCalibrate(uint32_t adc_address);
void GD32_HAL_ADC_Disable(uint32_t adc_address);
int GD32_HAL_ADC_IsEnabled(uint32_t adc_address);
int GD32_HAL_ADC_IsCalibrationValid(uint32_t adc_address);
void GD32_HAL_ADC_SetCalibrationValid(uint32_t adc_address);
void GD32_HAL_ADC_InvalidateCalibration(uint32_t adc_address);
void GD32_HAL_ADC_StartSoftware(uint32_t adc_address);
uint32_t GD32_HAL_ADC_GetFlag(uint32_t adc_address, uint32_t flags);
void GD32_HAL_ADC_ClearFlag(uint32_t adc_address, uint32_t flags);
void GD32_HAL_ADC_SetInterrupt(uint32_t adc_address,
                               uint32_t interrupts,
                               int enable);
uint32_t GD32_HAL_ADC_GetInterrupts(uint32_t adc_address);
uint32_t GD32_HAL_ADC_ReadData(uint32_t adc_address);
uint32_t GD32_HAL_ADC_GetDataAddress(uint32_t adc_address);
void GD32_HAL_ADC_SetDMARequest(uint32_t adc_address, int enable);
int GD32_HAL_ADC_IsDMAChannelValid(uint32_t adc_address,
                                   uint32_t channel_address,
                                   uint32_t request_token);
int GD32_HAL_I2C_IsInstance(uint32_t i2c_address);
int GD32_HAL_I2C_Configure(uint32_t i2c_address,
                           const GD32_HAL_I2CConfig *config);
void GD32_HAL_I2C_DeInit(uint32_t i2c_address);
void GD32_HAL_I2C_Enable(uint32_t i2c_address);
void GD32_HAL_I2C_Disable(uint32_t i2c_address);
void GD32_HAL_I2C_Start(uint32_t i2c_address);
void GD32_HAL_I2C_Stop(uint32_t i2c_address);
void GD32_HAL_I2C_SetAck(uint32_t i2c_address, int enable);
void GD32_HAL_I2C_SetAckNext(uint32_t i2c_address, int next);
void GD32_HAL_I2C_SendAddress(uint32_t i2c_address,
                              uint16_t address,
                              int receive);
void GD32_HAL_I2C_WriteData(uint32_t i2c_address, uint8_t data);
uint8_t GD32_HAL_I2C_ReadData(uint32_t i2c_address);
uint32_t GD32_HAL_I2C_GetFlags(uint32_t i2c_address);
void GD32_HAL_I2C_ClearAddress(uint32_t i2c_address);
uint32_t GD32_HAL_I2C_GetErrors(uint32_t i2c_address);
void GD32_HAL_I2C_ClearErrors(uint32_t i2c_address, uint32_t errors);
void GD32_HAL_I2C_SetInterrupts(uint32_t i2c_address,
                                uint32_t interrupts,
                                int enable);
uint32_t GD32_HAL_I2C_GetInterrupts(uint32_t i2c_address);
void GD32_HAL_I2C_SoftwareReset(uint32_t i2c_address);
int GD32_HAL_SPI_IsInstance(uint32_t spi_address);
int GD32_HAL_SPI_Configure(uint32_t spi_address,
                           const GD32_HAL_SPIConfig *config);
void GD32_HAL_SPI_DeInit(uint32_t spi_address);
void GD32_HAL_SPI_Enable(uint32_t spi_address);
void GD32_HAL_SPI_Disable(uint32_t spi_address);
void GD32_HAL_SPI_SetDirection(uint32_t spi_address, uint8_t direction);
void GD32_HAL_SPI_WriteData(uint32_t spi_address, uint16_t data);
uint16_t GD32_HAL_SPI_ReadData(uint32_t spi_address);
uint32_t GD32_HAL_SPI_GetFlags(uint32_t spi_address);
uint32_t GD32_HAL_SPI_GetErrors(uint32_t spi_address);
void GD32_HAL_SPI_ClearErrors(uint32_t spi_address, uint32_t errors);
void GD32_HAL_SPI_SetInterrupts(uint32_t spi_address,
                                uint32_t interrupts,
                                int enable);
uint32_t GD32_HAL_SPI_GetInterrupts(uint32_t spi_address);
void GD32_HAL_SPI_SetDMARequest(uint32_t spi_address,
                                int transmit,
                                int enable);
uint32_t GD32_HAL_SPI_GetDataAddress(uint32_t spi_address);
int GD32_HAL_SPI_IsDMAChannelValid(uint32_t spi_address,
                                   int transmit,
                                   uint32_t channel_address,
                                   uint32_t request_token);
void GD32_HAL_RCC_DeInit(void);
int GD32_HAL_RCC_SetInstanceClock(uintptr_t stm32_instance,
                                  GD32_HAL_ResourceKind kind,
                                  int enable);
int GD32_HAL_RCC_SetCommonClock(GD32_HAL_RCCCommonClock clock, int enable);
int GD32_HAL_RCC_SetIRC8M(int enable, uint32_t calibration);
int GD32_HAL_RCC_SetHXTAL(uint32_t state);
int GD32_HAL_RCC_SetPLL(int enable);
uint32_t GD32_HAL_RCC_GetOscillatorState(void);
uint32_t GD32_HAL_RCC_GetIRC8MCalibration(void);
uint32_t GD32_HAL_RCC_GetSystemSource(void);
uint32_t GD32_HAL_RCC_GetSourceFrequency(uint32_t source);
uint32_t GD32_HAL_RCC_GetClockFrequency(GD32_HAL_RCCClock clock);
uint32_t GD32_HAL_RCC_GetAHBDivider(void);
uint32_t GD32_HAL_RCC_GetAPB1Divider(void);
uint32_t GD32_HAL_RCC_GetAPB2Divider(void);
int GD32_HAL_RCC_ApplyClockConfig(uint32_t source,
                                  uint32_t ahb_divider,
                                  uint32_t apb1_divider,
                                  uint32_t apb2_divider,
                                  int increasing);
void GD32_HAL_RCC_SetFlashWaitState(uint32_t wait_state);
uint32_t GD32_HAL_RCC_GetFlashWaitState(void);
void GD32_HAL_RCC_EnableClockMonitor(int enable);
uint32_t GD32_HAL_RCC_GetClockMonitorInterrupt(void);
void GD32_HAL_RCC_ClearClockMonitorInterrupt(void);
int GD32_HAL_EXTI_Configure(uint8_t line,
                            uint32_t mode,
                            uint32_t trigger,
                            uint32_t gpio_source);
void GD32_HAL_EXTI_GetConfig(uint8_t line,
                             uint32_t *mode,
                             uint32_t *trigger,
                             uint32_t *gpio_source);
void GD32_HAL_EXTI_ClearConfig(uint8_t line);
uint32_t GD32_HAL_EXTI_GetPending(uint8_t line);
void GD32_HAL_EXTI_ClearPending(uint8_t line);
void GD32_HAL_EXTI_GenerateSWI(uint8_t line);
void GD32_HAL_FLASH_Unlock(void);
void GD32_HAL_FLASH_Lock(void);
GD32_HAL_FLASHStatus GD32_HAL_FLASH_ProgramHalfWord(uint32_t address,
                                                    uint16_t data);
GD32_HAL_FLASHStatus GD32_HAL_FLASH_ProgramWord(uint32_t address,
                                                uint32_t data);
GD32_HAL_FLASHStatus GD32_HAL_FLASH_ErasePage(uint32_t page_address);
GD32_HAL_FLASHStatus GD32_HAL_FLASH_StartProgramIT(uint32_t address,
                                                   uint32_t data,
                                                   uint32_t width);
GD32_HAL_FLASHStatus GD32_HAL_FLASH_StartErasePageIT(uint32_t page_address);
uint32_t GD32_HAL_FLASH_GetInterrupts(void);
void GD32_HAL_FLASH_ClearInterrupts(uint32_t interrupts);
void GD32_HAL_FLASH_EndITOperation(void);
void GD32_HAL_SysTickIRQHandler(void);

#ifdef __cplusplus
}
#endif

#endif /* STM32_HAL_PORT_API_H */
